app/views/users/show.html.erb

SELECT "arts".* FROM "arts" WHERE "arts"."user_id" = ?  [["user_id", 11]]
---
<div class="row">
  <% @user.arts.each do |art| %>