app/views/arts/index.html.erb

      <div class="card-content">
        <span class="card-title activator grey-text text-darken-4"><%= art.tags.first.description %><i class="material-icons right">more_vert</i></span>
        <p><a href="http://localhost:3000/users/<%= art.user_id %>"><%= art.user.first_name %></a></p>
---
SELECT  "tags".* FROM "tags" WHERE "tags"."art_id" = ?  ORDER BY "tags"."id" ASC LIMIT 1  [["art_id", 57]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]