app/controllers/arts_controller.rb

def index
    @arts = Art.all
---
SELECT "arts".* FROM "arts" WHERE (vision LIKE '%cat%')

  def show
    @art = Art.find(params[:id])
---
SELECT  "arts".* FROM "arts" WHERE "arts"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @user = current_user

    @art_tags = GoogleCloudVision::Classifier.new("AIzaSyDZrCdlDY9Nj1abJZIYIjKWyYIwNj1o-Jg",
    [{ image: 'public/ducks.jpg', detection: 'LABEL_DETECTION', max_results: 10 }]).response

    @art = Art.new({image: art_params[:image], user_id: @user.id, vision: @art_tags})

    if @art.save
---
INSERT INTO "arts" ("image", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["image", "https://ucarecdn.com/2ff31442-8240-4743-9fa8-6f6492d422ce/"], ["user_id", 4], ["created_at", "2016-06-29 20:43:21.883142"], ["updated_at", "2016-06-29 20:43:21.883142"]]
INSERT INTO "tags" ("art_id", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["art_id", 67], ["description", "automobile"], ["created_at", "2016-06-30 22:59:10.537321"], ["updated_at", "2016-06-30 22:59:10.537321"]]

  def edit
    @art = Art.find(params[:id])
---
SELECT  "arts".* FROM "arts" WHERE "arts"."id" = ? LIMIT 1  [["id", 5]]