app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "location", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "users" SET "email" = ?, "location" = ?, "image" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "kim@min.com"], ["location", "hello"], ["image", "https://ucarecdn.com/587392ef-dd41-4619-b8b3-2e757ddaaf33/"], ["updated_at", "2016-06-28 21:20:55.091659"], ["id", 1]]